tutorials/incompressible/pimpleHFDIBFoam/fallingParticle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0      0      0)
    (8      0      0)
    (8      8      0)
    (0      8      0)
    (0      0     80)
    (8      0     80)
    (8      8     80)
    (0      8     80)
);

blocks
(
    // dp/h = 10 -> cell size = 0.1 (in blockMesh units)
    hex (0 1 2 3 4 5 6 7) (64 64 640) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  bottom
  {
    type cyclic;
    neighbourPatch top;
    faces
    (
      (0 1 2 3)
    );
  }

  top
  {
    type cyclic;
    neighbourPatch bottom;
    faces
    (
      (4 5 6 7)
    );
  }

  xMin
  {
    type wall;
    faces
    (
      (0 3 7 4)
    );
  }

  xMax
  {
    type wall;
    faces
    (
      (1 5 6 2)
    );
  }

  yMin
  {
    type wall;
    faces
    (
      (0 1 5 4)
    );
  }

  yMax
  {
    type wall;
    faces
    (
      (3 2 6 7)
    );
  }
);

mergePatchPairs
(
);

// ************************************************************************* //
