tutorials/incompressible/pimpleHFDIBFoam/fallingParticle/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ( "icoSphere" );

interpolationSchemes
{
  U cellPointFace;
  T cellPointFace;
  method line;
}

surfaceThreshold    1e-4;
stepDEM     0.02;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain 1000;       //Sets Upper Limit On Number Of Particles In Domain if not spcecified sets to 1000 by default

virtualMesh
{
    level 2;
    charCellSize 0.001;
}

outputSetup
{
    basic true;
    iB  false;
    DEM false;
    addModel true;
    parallelDEM false;
}

DEM
{
    LcCoeff 4.0;
    rotationModel chen2012;
	// rotationModel mindlin1953
    materials
    {
        particle
        {
            Y       1e7;
            nu      0.3;
            mu      0.05;
            adhN    0;
            eps     0.5;
        }

        wall
        {
            Y       1e7;
            nu      0.2;
            mu      0;
            adhN    0;
            eps     0.5;
        }
    }

    collisionPatches
    {
        wallXMin
        {
            material wall;
            nVec (-1 0 0);
            planePoint (0 0 0);
        }

        wallXMax
        {
            material wall;
            nVec (1 0 0);
            planePoint (0.08 0 0);
        }

        wallYMin
        {
            material wall;
            nVec (0 -1 0);
            planePoint (0 0 0);
        }

        wallYMax
        {
            material wall;
            nVec (0 1 0);
            planePoint (0 0.08 0);
        }
    }

    cyclicPatches
    {
        top
        {
            nVec (0 0 1);
            planePoint (0 0 0.8);
            neighbourPatch bottom;
        }

        bottom
        {
            nVec (0 0 -1);
            planePoint (0 0 0);
            neighbourPatch top;
        }
    }
}

icoSphere
{
fullyCoupledBody;
rho         rho [1 -3 0 0 0 0 0] 1.404;
U
{
	BC  noSlip;
}
material particle;
bodyGeom convex;
updateTorque true;
sdBasedLambda true;
interfaceSpan 1.0;
startSynced false;
refineBuffers 1;
timesToSetStatic 30; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
bodyAddition
{
	addModel once;
    onceCoeffs{}
}

T
{
    BC fixedValue;
    value 350;
    innerValue 350;
    bulkTemperature 300;
    dynamic true;
    computeNu true;
    cpParticle 10050;
    cpFluid 1005;
    minDeltaT 1e-3;
    solidFractionThreshold 0.999;
    characteristicLength 0.01;
    referenceArea 3.14159e-4;
    thermalDebug true;
}
}

// ************************************************************************* //
