tutorials/incompressible/pimpleHFDIBFoam/fallingParticle/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    xMin
    {
        type            slip;
    }

    xMax
    {
        type            slip;
    }

    yMin
    {
        type            slip;
    }

    yMax
    {
        type            slip;
    }

    bottom
    {
        type            cyclic;
    }

    top
    {
        type            cyclic;
    }
}



// ************************************************************************* //
