tutorials/incompressible/pimpleHFDIBFoam/fallingParticle/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  8                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    xMin
    {
        type            zeroGradient;
    }

    xMax
    {
        type            zeroGradient;
    }

    yMin
    {
        type            zeroGradient;
    }

    yMax
    {
        type            zeroGradient;
    }

    bottom
    {
        type            cyclic;
    }

    top
    {
        type            cyclic;
    }
}


// ************************************************************************* //
