tutorials/incompressible/pimpleHFDIBFoam/fallingParticle/0/lambda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xMin
    {
        type            fixedValue;
        value           uniform 0;
    }

    xMax
    {
        type            fixedValue;
        value           uniform 0;
    }

    yMin
    {
        type            fixedValue;
        value           uniform 0;
    }

    yMax
    {
        type            fixedValue;
        value           uniform 0;
    }

    bottom
    {
        type            cyclic;
    }

    top
    {
        type            cyclic;
    }
}


// ************************************************************************* //
